In [40]:
import pandas as pd
import numpy as np

In [41]:
data = pd.read_csv('cities_csv.csv')

In [42]:
data.head()

,Date,AZ-Phoenix,CA-Los Angeles,CA-San Diego,CA-San Francisco,CO-Denver,DC-Washington,FL-Miami,FL-Tampa,GA-Atlanta,...,NC-Charlotte,NV-Las Vegas,NY-New York,OH-Cleveland,OR-Portland,TX-Dallas,WA-Seattle,Composite-10,Composite-20,National-US
0,1987-01-01,NaN,59.33,54.67,46.61,50.20,64.11,68.50,77.33,NaN,...,63.39,66.36,74.42,53.53,41.05,NaN,NaN,62.82,NaN,63.75
1,1987-02-01,NaN,59.65,54.89,46.87,49.96,64.77,68.76,77.93,NaN,...,63.94,67.03,75.43,53.50,41.28,NaN,NaN,63.39,NaN,64.15
2,1987-03-01,NaN,59.99,55.16,47.32,50.15,65.71,69.23,77.76,NaN,...,64.17,67.34,76.25,53.68,41.06,NaN,NaN,63.87,NaN,64.49
3,1987-04-01,NaN,60.81,55.85,47.69,50.55,66.40,69.20,77.56,NaN,...,64.81,67.88,77.34,53.75,40.96,NaN,NaN,64.57,NaN,64.99
4,1987-05-01,NaN,61.67,56.35,48.31,50.63,67.27,69.46,77.85,NaN,...,65.18,67.90,79.16,54.71,41.24,NaN,NaN,65.56,NaN,65.57

In [43]:
data.columns

Index(['Date', 'AZ-Phoenix', 'CA-Los Angeles', 'CA-San Diego',
       'CA-San Francisco', 'CO-Denver', 'DC-Washington', 'FL-Miami',
       'FL-Tampa', 'GA-Atlanta', 'IL-Chicago', 'MA-Boston', 'MI-Detroit',
       'MN-Minneapolis', 'NC-Charlotte', 'NV-Las Vegas', 'NY-New York',
       'OH-Cleveland', 'OR-Portland', 'TX-Dallas', 'WA-Seattle',
       'Composite-10', 'Composite-20', 'National-US'],
      dtype='object')

### Check for Missing value and try to get all the info related to it

In [44]:
data.isna().sum()

Date                  0
AZ-Phoenix           24
CA-Los Angeles        0
CA-San Diego          0
CA-San Francisco      0
CO-Denver             0
DC-Washington         0
FL-Miami              0
FL-Tampa              0
GA-Atlanta           48
IL-Chicago            0
MA-Boston             0
MI-Detroit           48
MN-Minneapolis       24
NC-Charlotte          0
NV-Las Vegas          0
NY-New York           0
OH-Cleveland          0
OR-Portland           0
TX-Dallas           156
WA-Seattle           36
Composite-10          0
Composite-20        156
National-US           0
dtype: int64

In [45]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 348 entries, 0 to 347
Data columns (total 24 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Date              348 non-null    object
 1   AZ-Phoenix        324 non-null    float64
 2   CA-Los Angeles    348 non-null    float64
 3   CA-San Diego      348 non-null    float64
 4   CA-San Francisco  348 non-null    float64
 5   CO-Denver         348 non-null    float64
 6   DC-Washington     348 non-null    float64
 7   FL-Miami          348 non-null    float64
 8   FL-Tampa          348 non-null    float64
 9   GA-Atlanta        300 non-null    float64
 10  IL-Chicago        348 non-null    float64
 11  MA-Boston         348 non-null    float64
 12  MI-Detroit        300 non-null    float64
 13  MN-Minneapolis    324 non-null    float64
 14  NC-Charlotte      348 non-null    float64
 15  NV-Las Vegas      348 non-null    float64
 16  NY-New York       348 non-null    float64
 17  OH-Cleveland      348 non-null    float64
 18  OR-Portland       348 non-null    float64
 19  TX-Dallas         192 non-null    float64
 20  WA-Seattle        312 non-null    float64
 21  Composite-10      348 non-null    float64
 22  Composite-20      192 non-null    float64
 23  National-US       348 non-null    float64
dtypes: float64(23), object(1)
memory usage: 65.4+ KB

#### First convert object into numerical

In [46]:
import pandas as pd

# Assuming 'data' is your DataFrame and 'Date' is your date column
data['Date'] = pd.to_datetime(data['Date'])

# Method 1: Ordinal Encoding
# data['ordinal_date'] = data['Date'].apply(lambda x: x.toordinal())

# # Method 2: Timestamps (Unix Time)
# data['timestamp'] = (data['Date'] - pd.Timestamp("1970-01-01")) // pd.Timedelta('1s')

# # Method 3: Extract Components
# data['year'] = data['Date'].dt.year
# data['month'] = data['Date'].dt.month
# data['day'] = data['Date'].dt.day
# # You can add more components like 'weekday', 'weekofyear', etc. as needed

# # Display the updated DataFrame
# print(data.head())

In [47]:
data.head()

,Date,AZ-Phoenix,CA-Los Angeles,CA-San Diego,CA-San Francisco,CO-Denver,DC-Washington,FL-Miami,FL-Tampa,GA-Atlanta,...,NC-Charlotte,NV-Las Vegas,NY-New York,OH-Cleveland,OR-Portland,TX-Dallas,WA-Seattle,Composite-10,Composite-20,National-US
0,1987-01-01,NaN,59.33,54.67,46.61,50.20,64.11,68.50,77.33,NaN,...,63.39,66.36,74.42,53.53,41.05,NaN,NaN,62.82,NaN,63.75
1,1987-02-01,NaN,59.65,54.89,46.87,49.96,64.77,68.76,77.93,NaN,...,63.94,67.03,75.43,53.50,41.28,NaN,NaN,63.39,NaN,64.15
2,1987-03-01,NaN,59.99,55.16,47.32,50.15,65.71,69.23,77.76,NaN,...,64.17,67.34,76.25,53.68,41.06,NaN,NaN,63.87,NaN,64.49
3,1987-04-01,NaN,60.81,55.85,47.69,50.55,66.40,69.20,77.56,NaN,...,64.81,67.88,77.34,53.75,40.96,NaN,NaN,64.57,NaN,64.99
4,1987-05-01,NaN,61.67,56.35,48.31,50.63,67.27,69.46,77.85,NaN,...,65.18,67.90,79.16,54.71,41.24,NaN,NaN,65.56,NaN,65.57

In [49]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 348 entries, 0 to 347
Data columns (total 24 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Date              348 non-null    datetime64[ns]
 1   AZ-Phoenix        324 non-null    float64
 2   CA-Los Angeles    348 non-null    float64
 3   CA-San Diego      348 non-null    float64
 4   CA-San Francisco  348 non-null    float64
 5   CO-Denver         348 non-null    float64
 6   DC-Washington     348 non-null    float64
 7   FL-Miami          348 non-null    float64
 8   FL-Tampa          348 non-null    float64
 9   GA-Atlanta        300 non-null    float64
 10  IL-Chicago        348 non-null    float64
 11  MA-Boston         348 non-null    float64
 12  MI-Detroit        300 non-null    float64
 13  MN-Minneapolis    324 non-null    float64
 14  NC-Charlotte      348 non-null    float64
 15  NV-Las Vegas      348 non-null    float64
 16  NY-New York       348 non-null    float64
 17  OH-Cleveland      348 non-null    float64
 18  OR-Portland       348 non-null    float64
 19  TX-Dallas         192 non-null    float64
 20  WA-Seattle        312 non-null    float64
 21  Composite-10      348 non-null    float64
 22  Composite-20      192 non-null    float64
 23  National-US       348 non-null    float64
dtypes: datetime64[ns](1), float64(23)
memory usage: 65.4 KB

In [50]:
data.isna().sum()

Date                  0
AZ-Phoenix           24
CA-Los Angeles        0
CA-San Diego          0
CA-San Francisco      0
CO-Denver             0
DC-Washington         0
FL-Miami              0
FL-Tampa              0
GA-Atlanta           48
IL-Chicago            0
MA-Boston             0
MI-Detroit           48
MN-Minneapolis       24
NC-Charlotte          0
NV-Las Vegas          0
NY-New York           0
OH-Cleveland          0
OR-Portland           0
TX-Dallas           156
WA-Seattle           36
Composite-10          0
Composite-20        156
National-US           0
dtype: int64

In [ ]:
data.fillna